{
  "HomePage": {
    "title": "OLÁ MUNDO!"
  },
  "NavBar": {
    "about": "Sobre",
    "projects": "Projetos",
    "knowledge": "Conhecimentos",
    "certificates": "Certificados"
  },
  "About": {
    "name": "Meu nome é",
    "iam": "Eu sou um",
    "job": "Desenvolvedor de Software",
    "description": "Desenvolvedor Full-stack com forte foco em desenvolvimento backend utilizando Java e Spring, com ampla experiência na construção de APIs REST robustas. Recém-formado em Análise e Desenvolvimento de Sistemas pela FIAP, busco continuamente expandir minhas habilidades por meio de projetos práticos e aprendizado contínuo em plataformas modernas de desenvolvimento.\n\nTenho experiência na construção de APIs RESTful utilizando Java (Spring Boot), Kotlin e Ruby, além do desenvolvimento de sistemas monolíticos fullstack com Next.js e TypeScript. Sou habilidoso em projetar soluções escaláveis que se integram perfeitamente a bancos de dados e serviços externos, sempre priorizando desempenho, manutenibilidade do código e experiência do usuário.\n\nBaseado em São Paulo, sou apaixonado por aplicar minhas habilidades para criar soluções digitais inovadoras. Sou totalmente bilíngue em português e inglês, com forte capacidade de comunicação e colaboração em ambientes diversos. Bilíngue (Português e Inglês).",
    "linkedin-alt": "Icone do LinkedIn",
    "github-alt": "Icone do Github",
    "whatsapp-alt": "Icone do Whatsapp",
    "picture-alt": "Foto de Vinicius Leonel"
  },
  "Knowledge": {
    "title": "Knowledge",
    "backend": {
      "title": "Backend",
      "description": "Desenvolvimento de APIs robustas e escaláveis com Spring Boot, JWT e Docker. Criação de endpoints RESTful, configuração de segurança com JWT e documentação interativa via Swagger. Uso de Docker para garantir consistência entre ambientes. Experiência com Hibernate e JPA para mapeamento de dados, além de gerenciamento de versões de esquema de banco de dados com Flyway."
    },
    "frontend": {
      "title": "Frontend",
      "description": "Desenvolvimento Frontend com Reactjs, Nextjs e TypeScript. Criação de aplicações web modernas, responsivas e de alta performance utilizando Next.js, que proporciona pré-renderização de páginas, roteamento simplificado e suporte a SSR (Server-Side Rendering). Com React, desenvolvo interfaces de usuário interativas e reutilizáveis, otimizando tanto a experiência do usuário quanto a eficiência do desenvolvimento. O uso de TypeScript permite uma tipagem estática robusta, ajudando a identificar e corrigir erros durante o desenvolvimento, além de melhorar a manutenibilidade e a escalabilidade do código."
    },
    "mobile": {
      "title": "Mobile",
      "description": "Desenvolvimento em Kotlin para aplicações Android, com foco no Jetpack Compose para criar interfaces de usuário modernas e dinâmicas. Implementação da arquitetura MVVM e integração de APIs RESTful usando Retrofit para comunicação eficiente com o backend. Aproveitamento das Coroutines do Kotlin para operações assíncronas, garantindo desempenho suave e responsividade. Gerenciamento eficaz de estado com ViewModels e LiveData para manter os componentes da UI sincronizados com os dados subjacentes."
    },
    "database": {
      "title": "Banco de Dados",
      "description": "Experiência com bancos de dados relacionais e não relacionais, incluindo Oracle, PostgreSQL, MySQL e MongoDB. Habilidade em modelar esquemas eficientes, otimizar consultas SQL e implementar ORM com Hibernate, JPA e Prisma. Com MongoDB, foco na gestão de dados não estruturados para construir aplicações escaláveis. Utilização de ferramentas de migração e versionamento, como Flyway e Prisma Migrate, para garantir consistência nas mudanças do banco de dados."
    },
    "devops": {
      "title": "DevOps",
      "description": "Experiência em Azure e GitHub Actions, incluindo a criação de pipelines CI/CD abrangendo tanto integração contínua (CI) quanto entrega contínua (CD). Realizei integração contínua configurando o ambiente Java com GitHub Actions e automatizando testes unitários, bem como entrega contínua, gerando imagens Docker, publicando no Docker Hub e implantando em aplicativos Web do Azure. Habilidade em automatizar o ciclo de entrega contínua para garantir atualizações eficientes e confiáveis de aplicações em nuvem."
    },
    "libs-framework": {
      "title": "Bibliotecas e Frameworks",
      "jwt": "JSON Web Token (JWT) é um padrão aberto (RFC 7519) que define uma maneira compacta e autocontida de transmitir informações com segurança entre as partes como um objeto JSON.",
      "zod": "Uma biblioteca de validação de esquemas para garantir a integridade e a correção dos dados.",
      "stripe": "Uma plataforma de pagamento usada para processar transações e gerenciar assinaturas.",
      "radixui": "Componentes de interface de usuário acessíveis e personalizáveis para construir aplicações web modernas.",
      "shadcnui": "Uma biblioteca de componentes de interface de usuário acessíveis e personalizáveis.",
      "googleoauth": "Um serviço de autenticação que permite aos usuários fazer login usando suas contas do Google.",
      "githuboauth": "Um serviço de autenticação que permite aos usuários fazer login usando suas contas do GitHub.",
      "nextauth": "Uma biblioteca para gerenciar autenticação em aplicações Next.js, proporcionando uma experiência de login perfeita e segura.",
      "nextintl": "O Next-intl é uma biblioteca para gerenciar a internacionalização (i18n) em aplicações Next.js, facilitando a tradução e localização de conteúdo."
    }
  },
  "Projects": {
    "LocawebAPP": {
      "description": "O Locaweb App é um aplicativo Android desenvolvido com Kotlin e Jetpack Compose, que usa a Locaweb API para gerenciar e enviar e-mails de forma intuitiva e eficiente."
    },
    "LocawebAPI": {
      "description": "A API Locaweb é uma aplicação desenvolvida em Kotlin e Spring, projetada especificamente para o aplicativo da Locaweb, permitindo o envio de e-mails entre usuários, garantindo um controle rigoroso de acesso e leitura."
    },
    "TrafficIncidentManagementAPI": {
      "description": "A API de Gerenciamento de Incidentes de Tráfego foi desenvolvida com Java e Spring, oferecendo soluções para o gerenciamento de acidentes de trânsito, usuários e autenticação."
    },
    "VollMedAPI": {
      "description": "A VollMed API é uma aplicação desenvolvida em Java com Spring Framework, destinada à gestão de uma clínica médica."
    },
    "MicroSaasToDo": {
      "description": "Este é um micro-SaaS de gerenciamento de tarefas que permite aos usuários criar, atualizar, excluir e visualizar tarefas, utilizando o Stripe para processar pagamentos para planos premium."
    },
    "Fintech": {
      "description": "A aplicação Fintech é uma plataforma que permite aos usuários gerenciar suas finanças pessoais, incluindo o cadastro e controle de receitas, despesas e investimentos."
    },
    "Covid19BrazilAPI": {
      "description": "Este projeto é um frontend que consome a API Covid19 Brasil, permitindo a busca de casos de Covid-19 no Brasil e no mundo."
    },
    "WeatherApp": {
      "description": "Desenvolvimento de um aplicativo Android com Jetpack Compose que consome uma API de clima para exibir a previsão do tempo de uma cidade específica."
    },
    "Pokedex": {
      "description": "Desenvolvimento de uma aplicação web que consome a PokeAPI para exibir informações sobre Pokémon, utilizando HTML, CSS e JavaScript."
    },
    "RubyAPI":{
      "description": "Esta API foi desenvolvida para integrar dois sistemas, permitindo a transformação de um arquivo de pedidos desnormalizado proveniente de um sistema legado em um arquivo JSON normalizado. A API oferece funcionalidades para acessar e gerenciar dados de pedidos, incluindo a capacidade de realizar consultas gerais e aplicar filtros específicos."
    }
  },
  "Languages": {
    "pt": "Português",
    "pt-alt": "Bandeira do Brasil",
    "en": "Inglês",
    "en-alt": "Bandeira dos Estados Unidos"
  },
  "Footer": {
    "text": "Em desenvolvimento - Vinicius Leonel"
  }
}
